[
  {
    "quadrant": "q1",
    "ring": "Adopt",
    "type": "new",
    "x": 460,
    "y": 380,
    "name": "Data Monitoring",
    "number": 1,
    "description": "Data Monitoring is a crucial technique in data management. It involves the real-time tracking and analysis of data to ensure its accuracy, security, and performance. Data monitoring allows organizations to detect anomalies, troubleshoot issues, and make informed decisions promptly. This technique is indispensable in today's data-driven world, enabling businesses to maintain a competitive edge by harnessing trustworthy data for insights and decision-making."
  },
  {
    "quadrant": "q1",
    "ring": "Adopt",
    "type": "new",
    "x": 420,
    "y": 400,
    "name": "Data Dictionary",
    "number": 2,
    "description": "A Data Dictionary is a foundational technique in data management, serving as a comprehensive catalog of data attributes within a system or database. It provides a structured, user-friendly reference for data definitions, metadata, and relationships, ensuring clarity and consistency in data usage. This technique empowers organizations and facilitates data governance. It is a critical asset for data professionals, helping them document, organize, and maintain data assets effectively. A well-maintained Data Dictionary enhances data transparency, aiding in data analysis, reporting, and compliance efforts."
  },
  {
    "quadrant": "q1",
    "ring": "Adopt",
    "type": "new",
    "x": 460,
    "y": 420,
    "name": "Log Analytics",
    "number": 3,
    "description": "Log Analytics is a practice or technology used in IT companies to collect, store, and analyze log data generated by various systems, applications, and devices. This data typically includes records of events, activities, errors, and performance metrics. It enables organizations to gain valuable insights into system performance, troubleshoot issues, and enhance security by detecting anomalies or suspicious activities. Log analytics tools can automatically index and search large volumes of log data, helping teams pinpoint critical information swiftly."
  },
  {
    "quadrant": "q1",
    "ring": "Trial",
    "type": "new",
    "x": 450,
    "y": 250,
    "name": "C4",
    "number": 4,
    "description": "C4 stands for Context, Container, Component, and Code, a design methodology used to create clear and effective software architecture diagrams. C4 diagrams help software architects and developers visualize and communicate the structure of their systems. It emphasizes depicting context (system boundaries), containers (high-level runtime elements like web servers), components (distinct parts within containers), and code (low-level implementation details). C4 promotes a layered and hierarchical approach to system documentation, making it easier for teams to understand, discuss, and maintain complex software architectures."
  },
  {
    "quadrant": "q1",
    "ring": "Trial",
    "type": "new",
    "x": 320,
    "y": 250,
    "name": "DQM",
    "number": 5,
    "description": "Data Quality Management (DQM) is a comprehensive technique employed to ensure the accuracy, consistency, and reliability of data within an organization. It involves a series of processes and practices for data profiling, cleansing, enrichment, and monitoring. DQM techniques enable businesses to identify and rectify data errors, inconsistencies, and anomalies, thereby enhancing data integrity. By establishing data quality standards, validation rules, and automated workflows, organizations can maintain high-quality data assets. This technique is essential for data-driven decision-making, compliance, and maintaining trust in data, fostering better operational and strategic outcomes."
  },
  {
    "quadrant": "q1",
    "ring": "Trial",
    "type": "new",
    "x": 260,
    "y": 350,
    "name": "Business Analytics",
    "number": 6,
    "description": "Business Analytics is a technique that involves the use of data analysis, statistical methods, and predictive modeling to extract actionable insights from a company's data. It helps organizations make informed decisions, optimize operations, and identify growth opportunities. By harnessing this technique, companies can improve their performance across various functions, from marketing and sales to finance and supply chain management. Business analytics also plays a vital role in creating a data-driven culture within a company, enabling it to stay competitive, adapt to market changes, and enhance its overall radar for strategic decision-making."
  },
  {
    "quadrant": "q1",
    "ring": "Trial",
    "type": "new",
    "x": 340,
    "y": 320,
    "name": "Alert Analytics",
    "number": 7,
    "description": "Alert Analytics is a strategic technique used by organizations to proactively monitor and respond to critical events and trends in real-time. It involves data streams and system-generated alerts to detect anomalies or trigger predefined actions. By swiftly identifying and addressing issues, organizations can improve operational efficiency, enhance security, and mitigate risks effectively. Alert analytics is an invaluable tool for maintaining a vigilant radar, ensuring respond promptly to emerging challenges and opportunities in today's dynamic business environment."
  },
  {
    "quadrant": "q1",
    "ring": "Trial",
    "type": "new",
    "x": 280,
    "y": 420,
    "name": "Incident Analytics",
    "number": 8,
    "description": "Incident analytics involves the analysis of incidents to understand their causes, impacts, and how they can be prevented in the future. The process of incident analytics typically involves collecting data from various sources, analyzing the data to identify patterns or anomalies, and then making recommendations or taking actions based on the findings."},
  {
    "quadrant": "q1",
    "ring": "Assess",
    "type": "new",
    "x": 270,
    "y": 200,
    "name": "Prompt Engineering",
    "number": 9,
    "description": "Prompt Engineering is a strategic technique focused on crafting compelling and contextually relevant prompts or queries for user interactions within software applications, chatbots, or virtual assistants. It involves designing prompts that effectively guide users, extract valuable information, and drive desired actions. Leading companies like Google and Amazon employ prompt engineering to enhance user experiences. By optimizing prompts, organizations can improve user engagement, increase conversions, and gather valuable data for decision-making."
  },
  {
    "quadrant": "q1",
    "ring": "Assess",
    "type": "new",
    "x": 210,
    "y": 240,
    "name": "SLI & SLO",
    "number": 10,
    "description": "Service Level Indicators (SLIs) and Service Level Objectives (SLOs) are crucial techniques in managing and ensuring the reliability of software systems. SLIs are metrics used to quantify the performance and availability of a service, while SLOs are specific, measurable targets set for SLIs. By using SLIs and SLOs, organizations can establish system performance and reliability, enabling proactive monitoring and rapid incident response. These techniques help maintain a vigilant radar by providing a structured framework to assess service health and drive continuous improvement, ensuring that services meet user expectations and business needs."
  },
  {
    "quadrant": "q1",
    "ring": "Assess",
    "type": "new",
    "x": 150,
    "y": 350,
    "name": "Low Code/No Code",
    "number": 11,
    "description": "Low-Code/No-Code (LC/NC) is a transformative technique in software development, offering a visual and user-friendly approach to create applications with minimal traditional coding. Platforms like Microsoft Power Apps and OutSystems have pioneered LC/NC development. These techniques empower organizations to accelerate application development, enabling business users to build their own solutions. By reducing the reliance on traditional coding, LC/NC fosters agility and innovation, allowing companies to swiftly respond to changing market demands. It's a crucial radar asset as it democratizes app development, fostering collaboration between IT and business teams, and enabling rapid prototyping and deployment of solutions to address evolving business needs."
  },
  {
    "quadrant": "q1",
    "ring": "Hold",
    "type": "new",
    "x": 160,
    "y": 150,
    "name": "Planning for full utilization",
    "number": 12,
    "description": "Planning for Full Utilization is a strategic technique that involves optimizing resource allocation to maximize efficiency and productivity across an organization. It entails a thorough assessment of available assets, such as human resources, equipment, or software licenses, and ensuring that they are utilized to their fullest potential. By implementing this technique, companies can reduce waste, improve cost-effectiveness, and enhance overall operational performance. It's a valuable addition to a company's radar as it promotes a culture of efficiency and resource optimization, ultimately leading to better financial outcomes and competitive advantage in today's dynamic business landscape."
  },
  {
    "quadrant": "q2",
    "ring": "Adopt",
    "type": "new",
    "x": 570,
    "y": 455,
    "name": "Dynatrace",
    "number": 13,
    "description": "Dynatrace is a leading application performance management and monitoring tool that provides real-time insights into the performance of software applications and the underlying infrastructure. It offers automatic discovery and baselining of application components, making it easier to identify and resolve performance bottlenecks and issues. Dynatrace helps organizations ensure optimal user experiences, reduce downtime, and improve efficiency by providing end-to-end visibility into the entire technology stack. It's a valuable asset for a company's radar, enabling proactive monitoring, rapid incident response, and data-driven optimization of application performance, ultimately leading to enhanced customer satisfaction and competitive advantage in the digital landscape."
  },
  {
    "quadrant": "q2",
    "ring": "Adopt",
    "type": "new",
    "x": 545,
    "y": 425,
    "name": "ELK",
    "number": 14,
    "description": "ELK, short for Elasticsearch, Logstash, and Kibana, is a powerful open-source toolset used for log and data analytics. Elasticsearch is a search and analytics engine, Logstash is a data collection and processing pipeline, and Kibana is a data visualization and exploration tool. Together, they form a robust platform for ingesting, storing, searching, and visualizing large volumes of data, making it an essential asset for monitoring and analyzing system logs, security events, and application performance. ELK is highly valuable for a company's radar, as it enables real-time insights, troubleshooting, and data-driven decision-making, enhancing overall operational efficiency and security."
  },
  {
    "quadrant": "q2",
    "ring": "Adopt",
    "type": "new",
    "x": 560,
    "y": 395,
    "name": "Kibana",
    "number": 15,
    "description": "Kibana is a powerful open-source data visualization and exploration tool that is a part of the ELK (Elasticsearch, Logstash, and Kibana) stack. It allows users to interactively explore, analyze, and visualize data stored in Elasticsearch in real-time. Kibana offers a user-friendly interface for creating visualizations, including charts, graphs, maps, and dashboards. It's a valuable asset for a company's radar as it enables teams to gain actionable insights from their data quickly, monitor system performance, and detect anomalies or trends. Kibana plays a pivotal role in data-driven decision-making and enhancing the overall effectiveness of an organization's operations."
  },
  {
    "quadrant": "q2",
    "ring": "Adopt",
    "type": "new",
    "x": 600,
    "y": 380,
    "name": "Quantum Metric",
    "number": 16,
    "description": "The Quantum Metric platform provides a structured approach to understanding the digital customer journey, enabling organizations to recognize customer needs, quantify the financial impact and prioritize based on the impact to the customer's and business's bottom line."},
  {
    "quadrant": "q2",
    "ring": "Adopt",
    "type": "new",
    "x": 600,
    "y": 420,
    "name": "Charles",
    "number": 17,
    "description": "Charles is a versatile web debugging proxy tool used for monitoring and analyzing network traffic between a device and the internet. It allows users to inspect HTTP/HTTPS requests and responses in real-time, making it a valuable asset for developers, testers, and security professionals. Charles provides insights into how web applications communicate with servers, helping diagnose issues, troubleshoot performance bottlenecks, and detect security vulnerabilities. It's an essential tool for enhancing the quality and security of web applications. Charles serves as a valuable component in a company's radar by ensuring web applications operate smoothly, securely, and efficiently."
  },
  {
    "quadrant": "q2",
    "ring": "Adopt",
    "type": "new",
    "x": 610,
    "y": 460,
    "name": "Tableau",
    "number": 18,
    "description": "Tableau is a leading data visualization and business intelligence tool that empowers organizations to turn raw data into actionable insights. It offers an intuitive interface for creating interactive and shareable dashboards, reports, and charts. Tableau supports data integration from various sources, enabling users to explore and analyze data efficiently. Its strength lies in its ability to simplify complex data, making it accessible to non-technical users. By transforming data into visual narratives, Tableau enhances data-driven decision-making, promotes data literacy, and facilitates a deeper understanding of business trends. It's an invaluable asset for a company's radar, enabling data-driven strategies and fostering a culture of informed decision-making."
  },
  {
    "quadrant": "q2",
    "ring": "Adopt",
    "type": "new",
    "x": 650,
    "y": 460,
    "name": "Snagit",
    "number": 19,
    "description": "Snagit is a versatile screenshot and screen recording software tool designed for capturing and editing visuals from your computer screen. It allows users to capture screenshots, record videos, and add annotations, text, and effects to create engaging and informative visuals. Snagit is an essential asset for businesses as it simplifies the process of creating instructional materials, documentation, and presentations. Its user-friendly interface and comprehensive editing features make it valuable for communication and collaboration. Snagit is a key tool for enhancing productivity, conveying ideas effectively, and improving the quality of visual content within a company, making it a valuable addition to the company's radar."
  },
  {
    "quadrant": "q2",
    "ring": "Adopt",
    "type": "new",
    "x": 630,
    "y": 410,
    "name": "Kafka",
    "number": 20,
    "description": "Kafka is a highly scalable and distributed streaming platform and message broker developed by the Apache Software Foundation. It is designed to handle real-time data streams efficiently, making it an essential tool for processing, publishing, and subscribing to data streams. Kafka is known for its fault tolerance, high throughput, and low latency, making it ideal for use cases like real-time analytics, log aggregation, and event-driven architectures. It plays a pivotal role in modern data infrastructure, ensuring reliable and real-time data flow. Kafka is a crucial component for a company's radar, enabling the efficient handling of data streams and supporting data-driven applications and insights."
  },
  {
    "quadrant": "q2",
    "ring": "Adopt",
    "type": "new",
    "x": 560,
    "y": 360,
    "name": "VS Code",
    "number": 21,
    "description": "Visual Studio Code (VS Code) is a highly popular and versatile code editor developed by Microsoft. It is renowned for its lightweight yet powerful features, making it a preferred choice for developers across various programming languages. VS Code supports a wide range of extensions, enabling customization and enhancing productivity. It offers features like debugging, Git integration, and intelligent code completion, streamlining the development process. VS Code is cross-platform, making it accessible on Windows, macOS, and Linux. It plays a vital role in a company's radar as a tool that boosts developer efficiency, fosters collaboration, and supports a seamless coding experience for software development projects."
  },
  {
    "quadrant": "q2",
    "ring": "Trial",
    "type": "new",
    "x": 580,
    "y": 270,
    "name": "Ice Panel",
    "number": 22,
    "description": "IcePanel is a collaborative diagramming tool that helps software engineering and product teams align on technical decisions. It is used to create interactive maps of software systems, and to give teams full context about how things work. IcePanel's key features includes: visual modeling language based on the C4 Model standard, collaborative workspace where teams can work together on diagrams, ability to link diagrams to code and other artifacts, rich documentation capabilities, Version control and history tracking. IcePanel is owned by IcePanel Labs, a software company based in London, UK."
  },
  {
    "quadrant": "q2",
    "ring": "Trial",
    "type": "new",
    "x": 680,
    "y": 250,
    "name": "Articulate",
    "number": 23,
    "description": "Articulate is a prominent e-learning authoring tool, known for its user-friendly interface and robust features. It empowers organizations to create engaging and interactive online courses and training materials. Articulate offers products like Storyline and Rise, allowing users to build custom e-learning modules and responsive content, respectively. With features like drag-and-drop interfaces, pre-built templates, and multimedia integration, it simplifies the development of educational content. Articulate is invaluable for companies investing in employee training and development, enabling them to enhance workforce skills and knowledge efficiently. It's a key asset for a company's radar, promoting effective learning and development initiatives to drive business success."
  },
  {
    "quadrant": "q2",
    "ring": "Trial",
    "type": "new",
    "x": 680,
    "y": 330,
    "name": "FCP",
    "number": 24,
    "description": "FCP, or Final Cut Pro, is a professional video editing software developed by Apple Inc. It's renowned for its advanced features and user-friendly interface, making it a preferred choice for video editors and filmmakers. FCP provides powerful video editing capabilities, including high-quality effects, audio editing, color grading, and support for 4K and HDR content. It's widely used for video post-production in film and television industries. FCP is an essential tool for content creators, enabling them to produce visually stunning videos and films. It plays a pivotal role in a company's radar for video production, facilitating the creation of high-quality, engaging video content."
  },
  {
    "quadrant": "q2",
    "ring": "Trial",
    "type": "new",
    "x": 590,
    "y": 240,
    "name": "PowerApps",
    "number": 25,
    "description": "PowerApps is a suite provided by Microsoft, allowing developers and non-technical users alike to build applications quickly with a low-code approach. Being in the 'Trial' ring signifies that while PowerApps provides promising solutions for rapid application development, especially for organizations already embedded in the Microsoft ecosystem, it still needs to be evaluated thoroughly in specific project contexts to understand its capabilities and limitations better. It offers a robust platform for creating mobile and desktop apps rapidly with a visual development environment, leveraging a wide array of pre-built templates and integrations."
  },
  {
    "quadrant": "q2",
    "ring": "Assess",
    "type": "new",
    "x": 780,
    "y": 230,
    "name": "Opsgenie",
    "number": 26,
    "description": "Opsgenie is a powerful incident management and alerting tool, now part of Atlassian's suite of products. It helps organizations effectively respond to and resolve incidents, such as system outages or security breaches, by orchestrating incident workflows, notifying the right teams, and providing real-time insights. Opsgenie offers integration with various monitoring and collaboration tools, streamlining incident management. With features like on-call scheduling and escalation policies, it ensures that the right people are alerted and action is taken promptly. Opsgenie is a crucial asset for a company's radar, ensuring operational reliability, minimizing downtime, and enhancing the overall incident response process."
  },
  {
    "quadrant": "q2",
    "ring": "Assess",
    "type": "new",
    "x": 840,
    "y": 250,
    "name": "Mage-AI",
    "number": 27,
    "description": "Mage is an open-source data pipeline tool designed for transforming and integrating data. It's essentially a modern replacement for Airflow. It offers a unique experience for developers, including a custom notebook user interface that enables the building of data pipelines. Mage also provides data loading clients that allow easy loading and exporting of data in pipelines, thus aiding the analyst in focusing more on transforming and analyzing data. Mage architecture incorporates a server that among other things handles API requests, interacts with storage to read/write data, and executes pipeline code."
  },
  {
    "quadrant": "q2",
    "ring": "Assess",
    "type": "new",
    "x": 650,
    "y": 150,
    "name": "Snowflake",
    "number": 28,
    "description": "Snowflake-AI is a suite of AI-powered products and services that help businesses make better decisions with their data. It includes capabilities for data search and discovery, machine learning, and natural language processing. Snowflake-AI is built on Snowflake's cloud-native data platform, which provides a secure, scalable, and reliable foundation for AI workloads. Snowflake is bringing the power of generative AI to data. With generative AI, teams can discover precisely the right data point, data asset, or data insight, making it possible to maximize the value of their data."
  },
  {
    "quadrant": "q3",
    "ring": "Adopt",
    "type": "new",
    "x": 360,
    "y": 580,
    "name": "Incident Management",
    "number": 29,
    "description": "Incident Management platforms streamline the process of detecting, responding to, and resolving IT incidents to minimize disruption and maintain optimal service levels. These platforms offer integrations with monitoring tools to automatically detect anomalies, thereby alerting relevant teams based on on-call schedules. They provide a centralized dashboard for real-time incident tracking, collaboration tools for teams to diagnose issues, and post-mortem analysis capabilities to understand root causes. By automating and organizing incident response, these platforms help reduce downtime, maintain service quality, and continuously improve operational resilience."
  },
  {
    "quadrant": "q3",
    "ring": "Adopt",
    "type": "new",
    "x": 400,
    "y": 640,
    "name": "Log Management",
    "number": 30,
    "description": "Log Management platforms centralize, store, and analyze log data generated from various sources within an IT environment. These platforms are essential for monitoring, troubleshooting, and securing applications and infrastructure. By aggregating logs from servers, applications, databases, and network devices, they offer a unified view of system health and activities. Advanced search capabilities facilitate rapid diagnostics of issues, while visualization tools provide insights into trends and patterns. Furthermore, these platforms play a crucial role in compliance and security, allowing for timely detection of malicious activities and maintaining audit trails. By offering scalable storage and real-time analysis, log management solutions are indispensable for maintaining robust and efficient IT ecosystems."
  },
  {
    "quadrant": "q3",
    "ring": "Adopt",
    "type": "new",
    "x": 450,
    "y": 580,
    "name": "Databse Management",
    "number": 31,
    "description": "Database Management Platforms (DBMPs) facilitate the creation, administration, and optimization of databases. Central to modern IT ecosystems, they ensure data is securely stored, efficiently retrievable, and consistently available. DBMPs support various database types, including relational, NoSQL, and in-memory databases. Key functionalities include data backup and recovery, performance tuning, security enforcement, and schema management. These platforms also offer interfaces for executing queries, visualizing data structures, and monitoring database health. Integration capabilities allow them to work seamlessly with other IT tools and platforms. By simplifying complex database operations, DBMPs empower businesses to harness their data effectively, ensuring robust performance, security, and scalability."
  },
  {
    "quadrant": "q3",
    "ring": "Adopt",
    "type": "new",
    "x": 400,
    "y": 580,
    "name": "Monitoring & Observations",
    "number": 32,
    "description": "Monitoring & Observability Platforms are essential tools for understanding the health, performance, and behavior of software systems. While monitoring proactively alerts teams about predefined issues or thresholds, observability delves deeper, allowing for ad-hoc exploration and understanding of system states from external outputs. These platforms collect data types like metrics (quantitative measurements), traces (request journeys), and logs (event records). With visualization dashboards, anomaly detection, and alerting mechanisms, they offer real-time insights and facilitate faster issue resolution. Integrating with deployment and incident management tools, they support a DevOps culture, ensuring software reliability, performance optimization, and enhanced user experiences."
  },
  {
    "quadrant": "q3",
    "ring": "Trial",
    "type": "new",
    "x": 250,
    "y": 680,
    "name": "Duck DB",
    "number": 33,
    "description": "DuckDB is a columnar database management system optimized for analytical and data-intensive workloads. It is designed to deliver high query performance and efficient memory usage, making it well-suited for interactive data analysis. DuckDB is often compared to other analytical databases like Apache Spark, Apache Impala, or ClickHouse, but it distinguishes itself with its focus on being an in-memory, embeddable, and highly efficient analytical database solution. It's particularly suitable for applications where real-time or near-real-time data analysis is required."
  },
  {
    "quadrant": "q3",
    "ring": "Trial",
    "type": "new",
    "x": 350,
    "y": 680,
    "name": "Automation and Orchestration",
    "number": 34,
    "description": "Automation and orchestration are two related but distinct concepts in the world of technology and operations. They play crucial roles in streamlining processes, reducing manual work, and improving efficiency. Automation refers to the use of technology and software to perform tasks or processes with minimal human intervention. It involves creating rules, scripts, or workflows that enable repetitive or routine tasks to be executed automatically. Orchestration is a higher-level concept that focuses on coordinating and managing multiple automated tasks or processes to achieve a specific outcome or workflow. It involves integrating different systems, services, and tasks into a cohesive and orchestrated workflow."
  },
  {
    "quadrant": "q3",
    "ring": "Assess",
    "type": "new",
    "x": 150,
    "y": 680,
    "name": "Github-Action",
    "number": 35,
    "description": "GitHub Actions empowers developers to automate repetitive tasks, streamline their development processes, and enhance collaboration among team members. It has become an integral part of modern software development, enabling more efficient and reliable software delivery pipelines."
  },
  {
    "quadrant": "q3",
    "ring": "Assess",
    "type": "new",
    "x": 180,
    "y": 780,
    "name": "Distributed Training",
    "number": 36,
    "description": "Distributed training is a machine learning technique that involves training a model using multiple computing resources simultaneously. Instead of relying on a single machine or processor, distributed training leverages the power of multiple machines, often connected in a cluster, to perform training tasks concurrently. This approach is particularly valuable for deep learning models, which can be computationally intensive and benefit from parallel processing."
  },
  {
    "quadrant": "q3",
    "ring": "Assess",
    "type": "new",
    "x": 250,
    "y": 800,
    "name": "Emerging Technologies",
    "number": 37,
    "description": "Emerging technologies refer to innovative advancements in various fields that have the potential to significantly impact industries, society, and the way we live and work. These technologies are often characterized by their rapid development and adoption, and they have the capacity to disrupt existing systems and create new opportunities. Some of the advanced technologies are AI, machine learning, blockchain, and many more. These emerging technologies have the potential to reshape industries, drive economic growth, and address global challenges. Staying informed about these advancements is essential for individuals and businesses looking to leverage the opportunities they present."
  },
  {
    "quadrant": "q4",
    "ring": "Adopt",
    "type": "new",
    "x": 560,
    "y": 650,
    "name": "Python",
    "number": 38,
    "description": "Python is a versatile and high-level programming language known for its simplicity, readability, and wide range of applications. Python has gained immense popularity in the software development community and is widely used for various purposes, including web development, data analysis, machine learning, artificial intelligence, scientific computing, scripting, and automation."
  },
  {
    "quadrant": "q4",
    "ring": "Adopt",
    "type": "new",
    "x": 590,
    "y": 650,
    "name": "React",
    "number": 39,
    "description": "React, also known as React.js or ReactJS, is an open-source JavaScript library for building user interfaces (UIs) and user interface components. Developed and maintained by Facebook, React has gained significant popularity in the web development community due to its efficient and declarative approach to building interactive web applications.React is widely used in the development of single-page applications (SPAs), progressive web applications (PWAs), and mobile applications (using technologies like React Native). It has become a fundamental part of modern web development and continues to evolve with new features and improvements."
  },
  {
    "quadrant": "q4",
    "ring": "Adopt",
    "type": "new",
    "x": 550,
    "y": 600,
    "name": "Fast API",
    "number": 40,
    "description": "FastAPI is an open-source web framework for building APIs with Python. It is designed to be fast, easy to use, and efficient, making it a popular choice for developing modern web applications and microservices. FastAPI is well-suited for a wide range of use cases, from building RESTful APIs to developing modern web applications with real-time features. Its combination of performance, automatic documentation, and ease of use makes it a compelling choice for Python developers working on web projects."
  },
  {
    "quadrant": "q4",
    "ring": "Adopt",
    "type": "new",
    "x": 580,
    "y": 610,
    "name": "PL/pgSQL",
    "number": 41,
    "description": "PL/pgSQL is the procedural language extension for PostgreSQL, one of the most popular open-source relational database management systems (RDBMS). It allows developers to write complex procedures and functions directly within the database. Similar in syntax to Oracle's PL/SQL and SQL Server's Transact-SQL (T-SQL), PL/pgSQL offers control structures, data manipulation, exception handling, and more. Procedures in PL/pgSQL can help in encapsulating business logic, enhancing performance, and ensuring data integrity. Once a function or procedure is written in PL/pgSQL, it can be invoked from SQL statements, enhancing PostgreSQL's SQL capabilities and enabling more sophisticated data operations and transformations."
  },
  {
    "quadrant": "q4",
    "ring": "Adopt",
    "type": "new",
    "x": 620,
    "y": 610,
    "name": "Jupyter Notebook",
    "number": 42,
    "description": "Jupyter Notebook is an open-source web application commonly used by researchers, data scientists, and programmers for interactive and exploratory computing. It allows users to create and share documents that contain live code, equations, visualizations, and narrative text. Jupyter Notebook supports various programming languages, including Python, R, Julia, and more, making it a versatile tool for data analysis, scientific computing, machine learning, and research. Users can execute code cells in real-time, view and manipulate data, and generate rich reports, making it a powerful platform for both learning and professional work in data-related fields."
  },
  {
    "quadrant": "q4",
    "ring": "Adopt",
    "type": "new",
    "x": 650,
    "y": 610,
    "name": "GraphQL",
    "number": 43,
    "description": "GraphQL is a query language for APIs and a runtime for executing those queries with your existing data. Developed by Facebook in 2012 and released as open-source in 2015, it provides a more flexible, robust, and efficient alternative to the traditional REST API. Instead of multiple endpoints with fixed data structures, GraphQL has a single endpoint that returns only the data clients request. It enables clients to specify exactly what data they need, which can reduce the amount of data transferred over the network and speed up applications With its type system, developers can define the types of data available, ensuring consistent and strong-typed results."
  },
  {
    "quadrant": "q4",
    "ring": "Assess",
    "type": "new",
    "x": 900,
    "y": 610,
    "name": "Litestar 2.0",
    "number": 44,
    "description": "Litestar is a powerful, flexible yet opinionated ASGI framework, focused on building APIs, and offers high-performance data validation and parsing, dependency injection, first-class ORM integration, authorization primitives, and much more that’s needed to get applications up and running."
  },
  {
    "quadrant": "q4",
    "ring": "Adopt",
    "type": "new",
    "x": 620,
    "y": 640,
    "name": "Mkdocs",
    "number": 45,
    "description": "MkDocs is a fast, simple, and downright gorgeous static site generator that's geared towards building project documentation. Documentation source files are written in Markdown and configured with a single YAML configuration file. It is placed in the 'Adopt' ring, which means organizations can confidently utilize MkDocs for their documentation needs, owing to its simplicity, extensive plugin ecosystem, and ease of use. It supports rich content and provides a seamless navigation structure, ensuring documentation is accessible and easy to explore, catering to various project documentation needs effectively."
  }  
]
